app/Views/components/raffle_banner.php


// Buscar prêmios extras (cotas premiadas - 70% do total)
$db = \Config\Database::connect();
$specialPrizes = $db->table('raffle_special_prizes')
    ->where('raffle_id', $activeRaffle['id'])
    ->where('is_active', 1)
    ->orderBy('number_pattern', 'ASC')
    ->get()
    ->getResultArray();
---
SELECT *
FROM `raffle_special_prizes`
WHERE `raffle_id` = '2'
AND `is_active` = 1
ORDER BY `number_pattern` ASC