app/Helpers/settings_helper.php

    function setting(string $key, $default = null)
    {
        static $cache = null;

        // Carregar cache na primeira chamada
        if ($cache === null) {
            try {
                $db = \Config\Database::connect();

                // Verificar se a tabela existe
                if (!$db->tableExists('settings')) {
                    $cache = [];
                    return $default;
                }

                $settings = $db->table('settings')->get()->getResultArray();
---
SELECT *
FROM `settings`