app/Controllers/AdminController.php

SELECT *
FROM `raffles`
ORDER BY `created_at` DESC
---
    public function raffles()
    {
        $check = $this->checkAdmin();
        if ($check) return $check;

        $raffleModel = new RaffleModel();
        $raffles = $raffleModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `raffles`
WHERE `raffles`.`id` = '1'
---
    public function editRaffle($id)
    {
        $check = $this->checkAdmin();
        if ($check) return $check;

        $raffleModel = new RaffleModel();
        $packageModel = new RafflePackageModel();

        $raffle = $raffleModel->find($id);

SELECT *
FROM `raffle_special_prizes`
WHERE `raffle_id` = '1'
ORDER BY `prize_amount` DESC
---

        // Buscar prêmios especiais
        $db = \Config\Database::connect();
        $specialPrizes = $db->table('raffle_special_prizes')
            ->where('raffle_id', $id)
            ->orderBy('prize_amount', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `raffles`
WHERE `raffles`.`id` = '1'
SELECT `raffle_purchases`.*, `users`.`name` as `user_name`, `users`.`email` as `user_email`
FROM `raffle_purchases`
LEFT JOIN `users` ON `users`.`id` = `raffle_purchases`.`user_id`
WHERE `raffle_id` = '1'
ORDER BY `created_at` DESC
---
    public function rafflePurchases($raffleId)
    {
        $check = $this->checkAdmin();
        if ($check) return $check;

        $raffleModel = new RaffleModel();
        $purchaseModel = new RafflePurchaseModel();

        $raffle = $raffleModel->find($raffleId);
        if (!$raffle) {
            return redirect()->to('/admin/raffles')->with('error', 'Rifa não encontrada.');
        }

        $purchases = $purchaseModel
            ->select('raffle_purchases.*, users.name as user_name, users.email as user_email')
            ->join('users', 'users.id = raffle_purchases.user_id', 'left')
            ->where('raffle_id', $raffleId)
            ->orderBy('created_at', 'DESC')
            ->findAll();

SELECT *
FROM `raffle_purchases`
WHERE `raffle_purchases`.`id` = '5'
---
    public function simulateRafflePayment($purchaseId)
    {
        $check = $this->checkAdmin();
        if ($check) return $check;

        $purchaseModel = new RafflePurchaseModel();
        $numberModel = new RaffleNumberModel();
        $raffleModel = new RaffleModel();
        $rankingModel = new RaffleRankingModel();

        log_message('debug', '=== SIMULATE PAYMENT START ===');
        log_message('debug', 'Purchase ID: ' . $purchaseId);

        $purchase = $purchaseModel->find($purchaseId);