app/Controllers/Campaign.php

SELECT COUNT(*) AS `numrows`
FROM `campaigns`
WHERE `status` = 'active'
AND   (
`title` LIKE '%1\' OR \'1\'=\'1%' ESCAPE '!'
OR  `description` LIKE '%1\' OR \'1\'=\'1%' ESCAPE '!'
 )
SELECT *
FROM `campaigns`
WHERE `status` = 'active'
AND   (
`title` LIKE '%1\' OR \'1\'=\'1%' ESCAPE '!'
OR  `description` LIKE '%1\' OR \'1\'=\'1%' ESCAPE '!'
 )
ORDER BY `created_at` DESC
 LIMIT 12
---
    public function index()
    {
        $perPage = 12;
        $page = $this->request->getGet('page') ?? 1;
        $category = $this->request->getGet('category');
        $search = $this->request->getGet('search');

        // Filtros - busca com ou sem categoria
        $builder = $this->campaignModel->where('status', 'active');

        if ($search) {
            $builder = $builder->groupStart()
                ->like('title', $search)
                ->orLike('description', $search)
            ->groupEnd();
        }

        if ($category) {
            $builder = $builder->where('category', $category);
        }

        $total = $builder->countAllResults(false);
        $campaigns = $builder->orderBy('created_at', 'DESC')
            ->findAll($perPage, ($page - 1) * $perPage);