app/Controllers/Home.php

SELECT COUNT(*) AS `numrows` FROM `campaigns`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT *
FROM `campaigns`
WHERE `status` = 'active'
ORDER BY `created_at` DESC
 LIMIT 6
---
    public function index()
    {
        // Buscar estatísticas reais da plataforma
        $stats = [
            'total_raised' => $this->getTotalRaised(),
            'total_campaigns' => $this->campaignModel->countAll(),
            'total_users' => $this->userModel->countAll(),
            'total_donors' => $this->getTotalDonors(),
        ];

        // Buscar campanhas em destaque (últimas 6 ativas)
        $featuredCampaigns = $this->campaignModel
            ->where('status', 'active')
            ->orderBy('created_at', 'DESC')
            ->limit(6)
            ->find();

SELECT SUM(`amount`) AS `amount`
FROM `donations`
WHERE `status` IN ('confirmed','received')
---
    private function getTotalRaised()
    {
        $result = $this->donationModel
            ->selectSum('amount')
            ->whereIn('status', ['confirmed', 'received'])
            ->get()
            ->getRowArray();

SELECT COUNT(DISTINCT donor_email) as total
FROM `donations`
WHERE `status` IN ('confirmed','received')
---
    private function getTotalDonors()
    {
        $result = $this->donationModel
            ->select('COUNT(DISTINCT donor_email) as total')
            ->whereIn('status', ['confirmed', 'received'])
            ->get()
            ->getRowArray();

SELECT SUM(`amount`) AS `amount`
FROM `donations`
WHERE `campaign_id` = '118'
AND `status` IN ('confirmed','received')
---
    private function getCampaignRaised($campaignId)
    {
        $result = $this->donationModel
            ->selectSum('amount')
            ->where('campaign_id', $campaignId)
            ->whereIn('status', ['confirmed', 'received'])
            ->get()
            ->getRowArray();

SELECT COUNT(DISTINCT donor_email) as total
FROM `donations`
WHERE `campaign_id` = '118'
AND `status` IN ('confirmed','received')
---
    private function getCampaignDonors($campaignId)
    {
        $result = $this->donationModel
            ->select('COUNT(DISTINCT donor_email) as total')
            ->where('campaign_id', $campaignId)
            ->whereIn('status', ['confirmed', 'received'])
            ->get()
            ->getRowArray();