app/Controllers/RaffleController.php

SELECT *
FROM `campaigns`
WHERE `status` = 'active'
AND `slug` != 'mantenha-a-plataforma-ativa'
ORDER BY `current_amount` DESC
 LIMIT 20
---
    public function show(string $slug)
    {
        $raffle = $this->raffleModel->findBySlug($slug);

        if (!$raffle) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $packages = $this->packageModel->getPackagesByRaffle($raffle['id']);
        $stats = $this->raffleModel->getStats($raffle['id']);
        $ranking = $this->rankingModel->getRanking($raffle['id'], 10);

        // Busca campanhas ativas para seleção
        $campaignModel = new CampaignModel();
        $campaigns = $campaignModel->where('status', 'active')
            ->where('slug !=', 'mantenha-a-plataforma-ativa')
            ->orderBy('current_amount', 'DESC')
            ->limit(20)
            ->findAll();

SELECT *
FROM `raffle_special_prizes`
WHERE `raffle_id` = '2'
AND `is_active` = 1
ORDER BY `prize_amount` DESC
---

        // Busca prêmios especiais/instantâneos cadastrados
        $db = \Config\Database::connect();
        $specialPrizes = $db->table('raffle_special_prizes')
            ->where('raffle_id', $raffle['id'])
            ->where('is_active', 1)
            ->orderBy('prize_amount', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `raffles`
WHERE `status` = 'finished'
ORDER BY `federal_lottery_date` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `raffles`
WHERE `status` = 'finished'
---
    public function history()
    {
        $db = \Config\Database::connect();
        $winnerModel = new RaffleWinnerModel();

        // Buscar rifas finalizadas
        $perPage = 10;
        $page = (int) ($this->request->getGet('page') ?? 1);
        $offset = ($page - 1) * $perPage;

        $raffles = $db->table('raffles')
            ->where('status', 'finished')
            ->orderBy('federal_lottery_date', 'DESC')
            ->limit($perPage, $offset)
            ->get()
            ->getResultArray();

SELECT SUM(`prize_amount`) AS `prize_amount`
FROM `raffle_winners`
WHERE `payment_status` = 'paid'
SELECT COUNT(*) AS `numrows`
FROM `raffle_winners`
SELECT SUM(`amount`) AS `amount`
FROM `raffle_campaign_distributions`
WHERE `transferred` = 1
---
        }

        // Estatisticas gerais
        $stats = [
            'total_raffles' => $total,
            'total_winners' => $db->table('raffle_winners')->countAllResults(),
            'total_prizes' => $db->table('raffle_winners')
                ->where('payment_status', 'paid')
                ->selectSum('prize_amount')
                ->get()
                ->getRow()->prize_amount ?? 0,
            'total_campaigns' => $db->table('raffle_campaign_distributions')
                ->where('transferred', 1)
                ->selectSum('amount')
                ->get()
                ->getRow()->amount ?? 0,
        ];