app/Models/AuditLogModel.php

INSERT INTO `audit_logs` (`user_id`, `action`, `entity_type`, `entity_id`, `old_value`, `new_value`, `ip_address`, `user_agent`, `extra_data`, `created_at`) VALUES (NULL, 'SUSPICIOUS_ACTIVITY', NULL, NULL, NULL, NULL, '::1', '', '{\"description\":\"Webhook ASAAS com assinatura HMAC inv\\u00e1lida\",\"ip\":\"::1\",\"signature_received\":\"...\"}', '2026-01-20 06:43:28')
---
    public function log(
        string $action,
        ?int $userId = null,
        ?string $entityType = null,
        ?int $entityId = null,
        $oldValue = null,
        $newValue = null,
        ?array $extraData = null
    ): int {
        $request = \Config\Services::request();

        // Detectar IP e User Agent (tratar caso CLI)
        $ipAddress = '0.0.0.0';
        $userAgent = 'CLI';

        try {
            $ipAddress = $request->getIPAddress();
            if (method_exists($request, 'getUserAgent')) {
                $ua = $request->getUserAgent();
                if ($ua && method_exists($ua, 'getAgentString')) {
                    $userAgent = substr($ua->getAgentString(), 0, 500);
                }
            }
        } catch (\Exception $e) {
            // CLI mode, usar valores padrão
        }

        return $this->insert([
            'user_id' => $userId,
            'action' => $action,
            'entity_type' => $entityType,
            'entity_id' => $entityId,
            'old_value' => $oldValue ? $this->sanitizeForLog($oldValue) : null,
            'new_value' => $newValue ? $this->sanitizeForLog($newValue) : null,
            'ip_address' => $ipAddress,
            'user_agent' => $userAgent,
            'extra_data' => $extraData ? json_encode($extraData) : null,
            'created_at' => date('Y-m-d H:i:s')
        ]);