app/Models/CampaignModel.php

    public function getCampaignWithStats($campaignId)
    {
        $campaign = $this->find($campaignId);

        if (!$campaign) {
            return null;
        }

        $db = \Config\Database::connect();

        // Buscar estatísticas em tempo real
        $stats = $db->table('donations')
            ->select("
                COUNT(*) as total_donations,
                SUM(amount) as total_amount
            ", false)
            ->where('campaign_id', $campaignId)
            ->where('status', 'received')
            ->get()
            ->getRowArray();
---
SELECT *
FROM `campaigns`
WHERE `campaigns`.`id` = '118'
SELECT COUNT(*) as total_donations,
                SUM(amount) as total_amount
FROM `donations`
WHERE `campaign_id` = '118'
AND `status` = 'received'