app/Models/RafflePackageModel.php

SELECT *
FROM `raffle_packages`
WHERE `raffle_id` = 2
ORDER BY `sort_order` ASC, `quantity` ASC
---
    public function getPackagesByRaffle(int $raffleId): array
    {
        return $this->where('raffle_id', $raffleId)
            ->orderBy('sort_order', 'ASC')
            ->orderBy('quantity', 'ASC')
            ->findAll();