app/Models/RaffleModel.php

    public function getActiveRaffle()
    {
        return $this->where('status', 'active')
            ->orderBy('created_at', 'DESC')
            ->first();
---
SELECT *
FROM `raffles`
WHERE `status` = 'active'
ORDER BY `created_at` DESC
 LIMIT 1

    public function findBySlug(string $slug)
    {
        return $this->where('slug', $slug)->first();
---
SELECT *
FROM `raffles`
WHERE `slug` = 'numeros-da-sorte-dezembro-2024'
 LIMIT 1

    public function getStats(int $raffleId): array
    {
        $raffle = $this->find($raffleId);
---
SELECT *
FROM `raffles`
WHERE `raffles`.`id` = 2

        $topBuyersPrizes = 1500 + 1000 + 500; // R$ 3.000

        // Cotas premiadas (soma dos prêmios especiais cadastrados)
        $specialPrizesTotal = $db->table('raffle_special_prizes')
            ->where('raffle_id', $raffleId)
            ->selectSum('prize_amount')
            ->get()
            ->getRow()->prize_amount ?? 0;
---
SELECT SUM(`prize_amount`) AS `prize_amount`
FROM `raffle_special_prizes`
WHERE `raffle_id` = 2