app/Models/RaffleRankingModel.php

SELECT *
FROM `raffle_rankings`
WHERE `raffle_id` = 2
ORDER BY `total_numbers` DESC, `total_spent` DESC
 LIMIT 10
---
    public function getRanking(int $raffleId, int $limit = 10): array
    {
        return $this->where('raffle_id', $raffleId)
            ->orderBy('total_numbers', 'DESC')
            ->orderBy('total_spent', 'DESC')
            ->limit($limit)
            ->findAll();